# Pandas

## 1. Series

In [1]:
import numpy as np
import pandas as pd

In [17]:
labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = { 'a': 10, 'b': 20, 'c': 30 }
my_data

[10, 20, 30]

In [30]:
# First Argument is data, Second Argument is labels
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [31]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [21]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [22]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [23]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [28]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', "USSR", "Japan"])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [32]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', "Italy", "Japan"])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [33]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## 2. Dataframes Part 1

In [35]:
from numpy.random import randn

In [36]:
np.random.seed(101)

In [38]:
# DataFrame(Data, Row Lables, Header Labels)
df = pd.DataFrame(randn(5,4),['A','B', 'C', 'D', 'E'], ['W','X','Y','Z'])

In [39]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
# Select Single Column
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [47]:
# Select Multiple Columns
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [49]:
# Create New Column
df['new'] = df['W'] + df['Y']

In [51]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [58]:
# Drop Column (0 axis = row, 1 axis = column)
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [59]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [60]:
df.drop('new', axis=1, inplace=True)

In [61]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [62]:
# Drop Row
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [63]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df.shape

(5, 4)

In [69]:
# Selecting Rows (Loc Method)
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [72]:
# 'iloc' locates row by index
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [74]:
# Select subset of single row & column
df.loc['B', 'Y']

-0.8480769834036315

In [75]:
# Select subset of rows & columns
df.loc[['A', 'B'],['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## 3. Dataframes Part 2

In [78]:
booldf = df > 0
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [79]:
# Identify rows + columns where conditions are true
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [80]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [81]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [86]:
resultdf = df[df['W']>0]
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [87]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [88]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [91]:
df[df['W']>0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [93]:
# Mulitple Conditions (have to use '&')
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [94]:
# OR Conditions (have to use '&')
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [96]:
# Reset Index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [98]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [100]:
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [102]:
# Set Column as index
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## 4. Dateframes Part 3

In [109]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [110]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [112]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])
df

             A         B
G1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
G2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [116]:
df.index.names = ['Groups', 'Numbers']

In [117]:
df

                       A         B
Groups Numbers
G1     1        1.025984 -0.156598
       2       -0.031579  0.649826
       3        2.154846 -0.610259
G2     1       -0.755325 -0.346419
       2        0.147027 -0.479448
       3        0.558769  1.024810

In [120]:
df.loc['G2'].loc[2]['B']

-0.4794480390410956

In [121]:
df.loc['G1'].loc[3]['A']

2.154846443259472

In [124]:
# Grab Cross Section
df.xs(1,level='Numbers')

               A         B
Groups
G1      1.025984 -0.156598
G2     -0.755325 -0.346419

## 5. Missing Data

In [126]:
d = {'A': [1,2,np.nan], 'B': [5, np.nan, np.nan], 'C': [1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [127]:
# Drop Row with null value
df.dropna()

     A    B  C
0  1.0  5.0  1

In [128]:
# Drop Columns with null value
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [131]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [132]:
# Fill NA values
df.fillna(value='Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [134]:
# Fill Missing values with mean of row
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## 6. Groupby

In [144]:
data = {'Company': ['GOOG','GOOG', 'MFST', 'MFST','FB','FB'], 
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales': [200, 120, 340, 124, 243, 350]
       }

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MFST      Amy    340
3    MFST  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [147]:
byComp = df.groupby('Company')

In [153]:
byComp.mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MFST     232.0

In [154]:
byComp.sum(numeric_only=True)

         Sales
Company
FB         593
GOOG       320
MFST       464

In [156]:
byComp.sum(numeric_only=True).loc['FB']

Sales    593
Name: FB, dtype: int64

In [158]:
# Best Practice is to do this in one line
df.groupby('Company').sum(numeric_only=True).loc["GOOG"]

Sales    320
Name: GOOG, dtype: int64

In [161]:
# Describe dataset
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MFST      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [163]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

## 7. Merging, Joining, Concatenating

In [167]:
df1 = pd.DataFrame({'A': ['A0','A1','A2','A3'],
                    'B': ['B0','B1','B2','B3'],
                    'C': ['C0','C1','C2','C3'],
                    'D': ['D0','D1','D2','D3'],
                   }, index=[0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [169]:
df2 = pd.DataFrame({'A': ['A4','A5','A6','A7'],
                    'B': ['B4','B5','B6','B7'],
                    'C': ['C4','C5','C6','C7'],
                    'D': ['D4','D5','D6','D7'],
                   }, index=[4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [170]:
df3 = pd.DataFrame({'A': ['A8','A9','A10','A11'],
                    'B': ['B8','B9','B10','B11'],
                    'C': ['C8','C9','C10','C11'],
                    'D': ['D8','D9','D10','D11'],
                   }, index=[8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [173]:
# Concatonate Dataframes (concats rows by default)
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [174]:
# Concatonate Columns
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [175]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [178]:
# Merge DataFrames together
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [184]:
# JOINING
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [185]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

##  8. Operations

In [186]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [187]:
# Grab all unique values in column
df['col2'].unique()

array([444, 555, 666])

In [188]:
# Number of unique values
df['col2'].nunique()

3

In [190]:
# Count of how many times each unique values occurs in the dataframe
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [191]:
def times2(x):
    return x*2

In [194]:
# Apply functions to dataset
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [195]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [197]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [199]:
# appply "inplace=True" to mutate dataset
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [201]:
# Get list of columns
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [202]:
# Get list of indexs
df.index

RangeIndex(start=0, stop=4, step=1)

In [204]:
# Sort Dataframe by columns
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [205]:
# Find null values
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [211]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [212]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [210]:
# Create Pivot Table
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## 9. Data Input & Output

* CSV
* Excel
* HTML
* SQL

In [214]:
# Read CSV File
pd.read_csv('example.csv')

,id,first_name,last_name,email,gender,ip_address,city
0,1,Joseph,Zaniolini,jzaniolini0@simplemachines.org,Male,163.168.68.132,Pedro Leopoldo
1,2,Freida,Drillingcourt,fdrillingcourt1@umich.edu,Female,97.212.102.79,Buri
2,3,Nanni,Herity,nherity2@statcounter.com,Female,145.151.178.98,Claver
3,4,Orazio,Frayling,ofrayling3@economist.com,Male,25.199.143.143,Kungur
4,5,Julianne,Murrison,jmurrison4@cbslocal.com,Female,10.186.243.144,Sainte-Luce-sur-Loire
...,...,...,...,...,...,...,...
995,996,Parrnell,Jeff,pjeffrn@4shared.com,Male,159.55.55.39,Dengok
996,997,Pat,Warstall,pwarstallro@dropbox.com,Male,169.200.7.131,Rosrio do Sul
997,998,Willyt,Vannuccini,wvannuccinirp@tuttocitta.it,Female,156.149.18.155,Xiaopingba
998,999,Gaelan,Petrashkov,gpetrashkovrq@hostgator.com,Male,219.109.169.75,Bethlehem
999,1000,Stirling,Francesc,sfrancescrr@cyberchimps.com,Male,108.193.9.206,Potok Zoty

In [7]:
df = pd.read_csv('example.csv')
df

,id,first_name,last_name,email,gender,ip_address,city
0,1,Joseph,Zaniolini,jzaniolini0@simplemachines.org,Male,163.168.68.132,Pedro Leopoldo
1,2,Freida,Drillingcourt,fdrillingcourt1@umich.edu,Female,97.212.102.79,Buri
2,3,Nanni,Herity,nherity2@statcounter.com,Female,145.151.178.98,Claver
3,4,Orazio,Frayling,ofrayling3@economist.com,Male,25.199.143.143,Kungur
4,5,Julianne,Murrison,jmurrison4@cbslocal.com,Female,10.186.243.144,Sainte-Luce-sur-Loire
...,...,...,...,...,...,...,...
995,996,Parrnell,Jeff,pjeffrn@4shared.com,Male,159.55.55.39,Dengok
996,997,Pat,Warstall,pwarstallro@dropbox.com,Male,169.200.7.131,Rosrio do Sul
997,998,Willyt,Vannuccini,wvannuccinirp@tuttocitta.it,Female,156.149.18.155,Xiaopingba
998,999,Gaelan,Petrashkov,gpetrashkovrq@hostgator.com,Male,219.109.169.75,Bethlehem
999,1000,Stirling,Francesc,sfrancescrr@cyberchimps.com,Male,108.193.9.206,Potok Zoty

In [219]:
df.to_csv('my_output',index=False)

In [220]:
pd.read_csv('my_output')

,id,first_name,last_name,email,gender,ip_address,city
0,1,Joseph,Zaniolini,jzaniolini0@simplemachines.org,Male,163.168.68.132,Pedro Leopoldo
1,2,Freida,Drillingcourt,fdrillingcourt1@umich.edu,Female,97.212.102.79,Buri
2,3,Nanni,Herity,nherity2@statcounter.com,Female,145.151.178.98,Claver
3,4,Orazio,Frayling,ofrayling3@economist.com,Male,25.199.143.143,Kungur
4,5,Julianne,Murrison,jmurrison4@cbslocal.com,Female,10.186.243.144,Sainte-Luce-sur-Loire
...,...,...,...,...,...,...,...
995,996,Parrnell,Jeff,pjeffrn@4shared.com,Male,159.55.55.39,Dengok
996,997,Pat,Warstall,pwarstallro@dropbox.com,Male,169.200.7.131,Rosrio do Sul
997,998,Willyt,Vannuccini,wvannuccinirp@tuttocitta.it,Female,156.149.18.155,Xiaopingba
998,999,Gaelan,Petrashkov,gpetrashkovrq@hostgator.com,Male,219.109.169.75,Bethlehem
999,1000,Stirling,Francesc,sfrancescrr@cyberchimps.com,Male,108.193.9.206,Potok Zoty

In [224]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [6]:
df.to_excel('excel_sample2.xlsx', sheet_name='NewSheet')

NameError: name 'df' is not defined

In [2]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

ValueError: No tables found

In [3]:
from sqlalchemy import create_engine

In [4]:
engine = create_engine('sqlite:///:memory:')

In [8]:
df.to_sql('my_table',engine)

1000